#+title: A sudoku-solving program
#+property: header-args :noweb yes :exports code
#+bibliography: references.bib

#+begin_export latex
\renewcommand*{\sudokuformat}[1]{\large\sffamily#1}
\setlength\sudokusize{5cm}
\setlength\sudokuthickline{1pt}
\newfloat{listing}{thp}{loll}
\floatname{listing}{Listing}
#+end_export


* Neighbouring cells

In order to determine whether an empty cell might hold a particular value, we need a way of determining its 'neighbours', that is, the cells in the same row, column, and \(3\times3\) square. For example, in the sudoku in \cref{easy}, the first empty cell (in the first row and the third column, counting from \(1\)) cannot be \(2\), \(5\), \(3\), \(9\), or \(1\), as these values are already present in the first row; it cannot be \(7\), as this is in the same column; and it cannot be \(2\) or \(4\), as these are present in the same square. By this reasoning, we know that it can only be \(6\) or \(8\).

\begin{figure}[H]
  \begin{sudoku}
    |2|5| | |3| |9| |1|.
    | |1| | | |4| | | |.
    |4| |7| | | |2| |8|.
    | | |5|2| | | | | |.
    | | | | |9|8|1| | |.
    | |4| | | |3| | | |.
    | | | |3|6| | |7|2|.
    | |7| | | | | | |3|.
    |9| |3| | | |6| |4|.
  \end{sudoku}
  \caption{An easy sudoku.\label{easy}}
\end{figure}

The function src_c{neighbours} takes an array index src_c{i} (from src_c{0} to src_c{80}) and writes the indices of every neighbouring cell into the array src_c{ns}. src_c{i} itself appears in src_c{ns} three times; this is of no consequence.

#+caption: Function to copy neighbouring indices of \identifier{i} into \identifier{ns}
#+name: neighbours
#+begin_src c
void neighbours(int i, int ns[27]) {
    <<initialize variables>>
    <<copy indices>>
}
#+end_src

#+begin_export latex
\begin{figure}[H]
  \centering
  \begin{BVerbatim}
#+end_export
#+begin_src python :exports results :results raw
output = ""

for i in range(81):
    output += f"{i: 3d}"
    if (i % 9) == 8:
        output += "\n"

return output
#+end_src

#+RESULTS:
  0  1  2  3  4  5  6  7  8
  9 10 11 12 13 14 15 16 17
 18 19 20 21 22 23 24 25 26
 27 28 29 30 31 32 33 34 35
 36 37 38 39 40 41 42 43 44
 45 46 47 48 49 50 51 52 53
 54 55 56 57 58 59 60 61 62
 63 64 65 66 67 68 69 70 71
 72 73 74 75 76 77 78 79 80
 #+begin_export latex
 \end{BVerbatim}
 \caption{The indices of the sudoku array, laid out in a \(9\times9\) grid.\label{indices}}
 \end{figure}
 #+end_export

The row and column matching up to the index src_c{i} are determined by integer division and the modulo function, respectively: an index's row corresponds to how many multiples of \(9\) it is away from zero, while its column corresponds to how far it is from the last multiple of \(9\). Compare index src_c{42} in \cref{indices}. \(\lfloor42/9\rfloor = 4\), which means that \(42\) is in the fourth row (counting from zero); \(42\text{ modulo }9 = 6\), so it is in the sixth column.

#+caption: Initialize variables
#+name: initialize variables
#+begin_src c
int row = i / 9;
int col = i % 9;
int t = 0;
int c = 0;
#+end_src

To find the index that begins row \(x\), we multiply \(x\) by \(9\).

#+caption: Copy neighbours' indices into \identifier{ns}
#+begin_src c :noweb-ref copy indices
c = row * 9;
while (t < 9) {
    ns[t++] = c;
    c += 1;
}
c = col;
while (t < 18) {
    ns[t++] = c;
    c += 9;
}
#+end_src

Finding the indices in the same \(3\times3\) square as a given index is slightly more complicated. We find the index of the square's top-left cell by performing integer division by \(3\) on the row and column numbers and multiplying them by \(3\) again.

#+begin_src c :noweb-ref copy indices
int rstart = (row / 3) * 3;
int cstart = (col / 3) * 3;
for (int j = rstart; j < rstart + 3; j++) {
    for (int k = cstart; k < cstart + 3; k++) {
        ns[t++] = cell_to_index(j, k);
    }
}
#+end_src

Now that we can find the neighbours of an index, it becomes simple to check whether a value can be legally placed in a particular position.

#+caption: Function to check whether \identifier{a} is allowed in index \identifier{c}
#+name: valid_attempt
#+begin_src c
int valid_attempt(<<sudoku>>,
                  int a, int c) {
    int ns[27];
    neighbours(c, ns);
    for (int i = 0; i < 27; i++) {
        if (sudoku[ns[i]] == a) {
            return 0;
        }
    }
    return 1;
}
#+end_src

* Reading a sudoku

The program reads a sudoku from a file as in \cref{file}, in which a digit represents the contents of a cell and a space corresponds to an empty cell.

#+begin_export latex
\begin{listing}[H]
  \centering
  \begin{BVerbatim}
#+end_export
#+begin_src bash :exports results :results raw
cat evil
#+end_src

#+RESULTS:
2   85
  8  95 6
        3
7  6  4 5
     4 2
  5    3
 1 7
       4
  2  69 8
#+begin_export latex
\end{BVerbatim}
\caption{The contents of a file to be read as a sudoku.\label{file}}
\end{listing}
#+end_export

The src_c{read_sudoku} function features only minimal error handling. It will complain if passed the name of a file that does not exist, but an attempt to read a file not in the format exemplified in \cref{file} will result in errors or garbage values.

#+caption: Function to read the sudoku at \identifier{filename}
#+name: read_sudoku
#+begin_src c
void read_sudoku(<<sudoku>>,
                 char *filename) {
    FILE *fp;
    char s[100];
    int row = 0;
    fp = fopen(filename, "r");
    if (fp == NULL) {
        printf("%s: file not found.\n", filename);
        exit(1);
    } else {
        while (fgets(s, sizeof(s), fp) != NULL && row < 9) {
            read_row(sudoku, row, s);
            row++;
        }
        fclose(fp);
    }
}
#+end_src

In order to use a file pointer and the functions src_c{fopen}, src_c{fgets}, src_c{printf}, and src_c{fclose}, we need to include the header ~stdio.h~. Likewise, the function src_c{exit} requires ~stdlib.h~.

#+begin_src c :noweb-ref includes
#include <stdio.h>
#include <stdlib.h>
#+end_src

The src_c{read_row} function is able to deal with lines that are less than nine characters long. This behaviour is useful, as many editors automatically remove whitespace at the ends of lines; the function assumes that any unspecified cells are empty. Anything beyond the ninth character is disregarded.

#+caption: Function to read one line of a file
#+name: read_row
#+begin_src c
void read_row(<<sudoku>>,
              int row, char *row_string) {
    int index = cell_to_index(row, 0);
    for (int col = 0; col < 9; col++, index++) {
        if (*row_string == '\0') {
            sudoku[index] = 0;
        } else {
            char c = *row_string++;
            if (c >= '1' && c <= '9') {
                sudoku[index] = c - '0';
            } else {
                sudoku[index] = 0;
            }
        }
    }
}
#+end_src

#+caption: The file-reading functions
#+name: reading
#+begin_src c
<<read_row>>
<<read_sudoku>>
#+end_src

* Testing

The following commands compile the program so that it can be invoked in the same directory by the commands ~./solve~ and ~./print~.

#+begin_src bash :exports code
cc sudoku.c -o solve
cc sudoku.c -o print
#+end_src

#+RESULTS:

So far, the program has managed to solve every sudoku I throw at it, including Finnish mathematician Arto Inkala's 'AI Escargot' (shown in \cref{escargot}), which [[https://www.kristanix.com/sudokuepic/worlds-hardest-sudoku.php][he claims]] is the hardest ever. \Cref{solved} shows the solution found by the program.

#+begin_export latex
\begin{figure}%[H]
  \begin{sudoku}
#+end_export
#+begin_src bash :results latex verbatim :exports results
./print escargot -tex
#+end_src

#+RESULTS:
#+begin_export latex
|1| | | | |7| |9| |.
| |3| | |2| | | |8|.
| | |9|6| | |5| | |.
| | |5|3| | |9| | |.
| |1| | |8| | | |2|.
|6| | | | |4| | | |.
|3| | | | | | |1| |.
| |4| | | | | | |7|.
| | |7| | | |3| | |.
#+end_export
#+begin_export latex
\end{sudoku}
\caption{The puzzle 'AI Escargot'.\label{escargot}}
\end{figure}
#+end_export

#+begin_export latex
\begin{figure}%[H]
  \begin{sudoku}
#+end_export
#+begin_src bash :results latex verbatim :exports results
./solve escargot -tex
#+end_src

#+RESULTS:
#+begin_export latex
|1|6|2|8|5|7|4|9|3|.
|5|3|4|1|2|9|6|7|8|.
|7|8|9|6|4|3|5|2|1|.
|4|7|5|3|1|2|9|8|6|.
|9|1|3|5|8|6|7|4|2|.
|6|2|8|7|9|4|1|3|5|.
|3|5|6|4|7|8|2|1|9|.
|2|4|1|9|3|5|8|6|7|.
|8|9|7|2|6|1|3|5|4|.
#+end_export
#+begin_export latex
\end{sudoku}
\caption{The solved puzzle.\label{solved}}
\end{figure}
#+end_export


The program is able to arrive at a solution rapidly. Compare \cref{time}, which is the result of applying the following commands to the puzzle shown in \cref{escargot}.

#+begin_src bash :exports both :results raw
ts=$(date +%s%N)
./solve escargot
# divide by \(10^6\) to convert from nano- (\%N) to milliseconds
tt=$((($(date +%s%N) - $ts)/1000000))
echo "Time taken: $tt milliseconds."
#+end_src

#+begin_export latex
\begin{listing}
  \centering
  \begin{BVerbatim}
#+end_export
#+RESULTS:
1 6 2 8 5 7 4 9 3
5 3 4 1 2 9 6 7 8
7 8 9 6 4 3 5 2 1
4 7 5 3 1 2 9 8 6
9 1 3 5 8 6 7 4 2
6 2 8 7 9 4 1 3 5
3 5 6 4 7 8 2 1 9
2 4 1 9 3 5 8 6 7
8 9 7 2 6 1 3 5 4
Time taken: 17 milliseconds.
#+begin_export latex
\end{BVerbatim}
\caption{The time taken by the program.\label{time}}
\end{listing}
#+end_export
